// 1. Задача
// Перевести название темы на русский язык и закомментировать.

// Variables - Перменные


// 2. Задача
// Создайте многострочный комментарий и поместите следующий текст:

// Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
// При этом может иметь значения, как NaN (Not a Number),
// Так и бесконечность (Infinity / -Infinity)

/*

При этом может иметь значения, как NaN (Not a Number),
Так и бесконечность (Infinity / -Infinity)
*/

// 3. Задача
// Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
// При этом может иметь значения, как NaN (Not a Number),
// Так и бесконечность (Infinity / -Infinity)

// 4. Задача
// let test;
// Значение переменной будет равняться - undefined.

// 5. Задача
//let num = 10;

// 6. Задача
//let text = 'JavaScript';

// 7. Задача
// let isChecked = true;

// 8. Задача
// let Variable = null;

// 9. Задача
// const EXPONENTIAL = '1e3'
// const EXP = 2.718;

// Стандартный вид записи: 3.7654 * 10 ^ 8 === 3.7654e8
// Экспонента: e (exp) =  2.718


// 10. Задача
// const BACKGROUND_COLOR = '#000';

// 11. Задача
// Variable declarations
// let studlyCapVar;
// let properCamelCase;
// let titleCaseOver;

// // Variable assignments
// studlyCapVar = 10;
// properCamelCase = 'A String';
// titleCaseOver = 9000;


// 12. Задача
// var numTest = 10;
// var numTest = 15;
// Оператор объявления var: можно объявить переменную повторно. Данная переменная продолжит существовать по заверщении выполнения блока.


// let numberTest = 10;
// let numberTest = 15;
// А оператор объявления let не допускает повторного объявления. Так как данный оператор существует лишь в внутри блока. Как только выполнится последнее выражение блока, переменная которую мы объявили при помощи оператора let - удалится из памяти. 