// 1. Задача
// Перевести название темы на русский язык и закомментировать.

// Variables - Перменные


// 2. Задача
// Создайте многострочный комментарий и поместите следующий текст:

// Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
// При этом может иметь значения, как NaN (Not a Number),
// Так и бесконечность (Infinity / -Infinity)

/*
Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
При этом может иметь значения, как NaN (Not a Number),
Так и бесконечность (Infinity / -Infinity)
*/
