// Задачи по теме 15. Array methods. Part 2 (callback - HOF)##
// 1. Задача
// Написать функцию, которая находит индекс первого числа в массиве, кратного 3.
// =============================================================================== //
// 2. Задача
// Написать функцию, которая находит индекс первого имени в массиве, длина которого больше 5.
// =============================================================================== //

// 3. Задача
// Написать функцию, которая находит индекс первого булевого true из массива любых типов данных.
// =============================================================================== //

// 4. Задача
// Написать функцию, которая ищет среди массива чисел первое встречное отрицательное число.
// =============================================================================== //

// 5. Задача
// Написать функцию, которая ищет среди массива имен первое встречное имя с длиной строки менее 4.
// =============================================================================== //

// 6. Задача
// Написать функцию, которая мутирует массив, заменяя все чётные числа на 777.
// =============================================================================== //

// 7. Задача
// Написать функцию, которая мутирует массив, заменяя все строки на число 0.
// =============================================================================== //

// 8. Задача
// Написать функцию, которая выводит в консоль все чётные индексы, начиная с 2.


console.log('text');