//Задачи по теме 3. Number

//1. Задача
//Пользователь вводит склавиатуры 2 числа. Выполнить деление первого на второе и записать в подробном виде:
//10 : 5 = 2

//let num = 10;
//let num2 = 5;

//let = prompt('Введите через пробел два числа 10 и 5');
//console.log(num + " / " + num2 + (num + num2));


// -------------------------------------------------------------


//2. Задача
//Запросить у пользователя 1 число. Прибавить к нему 10, записать в подробном виде:
//25 + 10 = 35

//let num = 25;
//let num2 = 10;

//let = prompt('Введите число 25');
//console.log(num);


//console.log(num + " + " + num2 + " = " + (num + num2));
//console.log(num + num2);


// -----------------------------------------------------------


//3. Задача
//Запросить у пользователя 1 число. Из 100 вычитаем запрошенное число, записать в подробном виде:
//100 - 17 = 83

//let num = 100;
//let num2 = 17;

//let = prompt('Введите число 17');
//console.log(num2);
//console.log(num + ' - ' + num2 + ' = ' + (num - num2));
//console.log(num - num2);


// -----------------------------------------------------------


//4. Задача
//Запросить 2 числа, выполнить умножение в подробном виде:
//5 × 7 = 35


//let num = 5;
//let num2 = 7;


//let = prompt('Введите число 5');
//let = prompt('Введите число 7');

//console.log(num);
//console.log(num2);


//1 - console.log(num * num2);
//2 - console.log(num + " * " + num2 + " = " + (num * num2));


// -----------------------------------------------------------


//5. Задача
//Запросить 2 числа, выполнить вычитание в подробном виде:
//10 - 13 = -3


//let num = 10;
//let num2 = 13;


//let = prompt('Введите число 10');
//let = prompt('Введите число 13');

//console.log(num);
//console.log(num2);



// 1-console.log(num - num2);
//2 - console.log(num + " - " + num2 + " = " + (num - num2));

// ----------------------------------------------------------


//6. Задача
//Запросить два числа, выполнить сначала умножение с этими числами, затем результат разделить на 2. Записать в подробном виде:
//10 × 50 : 2 = 250


//let num = 10;
//let num2 = 50;
//let num3 = 2;



//let = prompt('Введите чмсло 10');
//let = prompt('Введите чмсло 50');

//console.log(num);
//console.log(num2);


//console.log(num + " * " + num2 + " = " + (num * num2));


//let firstResult = (num * num2);
//console.log(firstResult);

//console.log(firstResult + ' / ' + num3 + ' = ' + (firstResult / num3));
//let sum = (firstResult / num3);
//console.log(sum);



//---------------------------------------------------------------------


//7. Задача
//Запросить у пользователя число. Вывести в консоль удвоенное число. Операцию записать в подробном виде:
//17 × 2 = 34


//let num = 17;
//let num2 = 2;

//let sum = 34;


//let = prompt('Введите число 17');

//let sum = (num + ' * ' + num2 + ' = ' + (num * num2));
//console.log(sum);



//console.log(num * num2);
//console.log(num + ' * ' + num2 + ' = ' + (num * num2));


// ---------------------------------------------------------------------



//8. Задача
//Запросить у пользователя имя. Запросить у пользователя его возраст. Вывести в консоль:
//Тебя зовут <имя>, после дня рождения тебе будет <возраст> лет!


// let nameUser = 'Егор';
// let ageUser = 20;


// let = prompt('Введите имя');
// let = prompt('Введите Ваш возраст');
// console.log('Тебя зовут ' + nameUser + ', после дня рождения тебе будет ' + ageUser + '!');
