//Задачи по теме 3. Number

//1. Задача
//Пользователь вводит склавиатуры 2 числа. Выполнить деление первого на второе и записать в подробном виде:
//10 : 5 = 2



// let num = Number(prompt('Введите число 1'));
// let num2 = Number(prompt('Введите число 2'));
// console.log(num + " : " + num2 + " = " + num / num2);
// 10 : 5 = 2


// -------------------------------------------------------------


//2. Задача
//Запросить у пользователя 1 число. Прибавить к нему 10, записать в подробном виде:
//25 + 10 = 35

// let num = Number(prompt('Введите число'));
// console.log(num + ' + 10 = ' + (num + 10));


// -----------------------------------------------------------

//3. Задача
//Запросить у пользователя 1 число. Из 100 вычитаем запрошенное число, записать в подробном виде:

// let num = Number(prompt('Введите число'));
// console.log('100 - ' + num + ' = ' + (100 - num));

// -----------------------------------------------------------


//4. Задача
//Запросить 2 числа, выполнить умножение в подробном виде:
//5 × 7 = 35


// let num = Number(prompt('Write your number 1'));
// let num2 = Number(prompt('Write your number 2'));

// console.log(num + ' × ' + num2 + ' = ' + num * num2);


// -----------------------------------------------------------


//5. Задача
//Запросить 2 числа, выполнить вычитание в подробном виде:
//10 - 13 = -3


// let num = Number(prompt('Write your number 1'));
// let num2 = Number(prompt('Write your number 2'));

// console.log(num + ' - ' + num2 + ' = ' + (num - num2));


// ----------------------------------------------------------


//6. Задача
//Запросить два числа, выполнить сначала умножение с этими числами, затем результат разделить на 2. Записать в подробном виде:
//10 × 50 : 2 = 250


// let num = Number(prompt('Write your number 1'));
// let num2 = Number(prompt('Write your number 2'));

// let sum = (num + ' × ' + num2 + ' : 2 ' + ' = ' + num * num2 / 2);
// console.log(sum);



//---------------------------------------------------------------------


//7. Задача
//Запросить у пользователя число. Вывести в консоль удвоенное число. Операцию записать в подробном виде:
//17 × 2 = 34


// let num = Number(prompt('Write your number'));
// console.log(num + ' × ' + '2 ' + '= ' + num * 2);


// ---------------------------------------------------------------------



//8. Задача
//Запросить у пользователя имя. Запросить у пользователя его возраст. Вывести в консоль:
//Тебя зовут <имя>, после дня рождения тебе будет <возраст> лет!


// let nameUser = prompt('Введите имя');
// let ageUser = Number(prompt('Введите Ваш возраст'));
// console.log('Тебя зовут ' + nameUser + ', после дня рождения тебе будет ' + (ageUser + 1) + '!');
