
// Задачи по теме 8. Array
// 1. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль количество элементов в массиве.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];

// console.log(array.length);

// for (const el of array) {
//   let countArr = 0;
//   countArr += el
//   console.log(countArr);
// }

// let countArr = 0;
// for (const el of array) {
//   countArr++
// }
// console.log(countArr);


// let count = 0;
// for (const el of array) {
//   if (typeof el === 'number') {
//     count += el
//   }
// }
// console.log(count);

// =======================================================================

// 2. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль индекс последнего элемента. Код должен работать для массива любой длины.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15];
// console.log(array[array.length - 1]);

// =======================================================================

// 3. Задача
// Создать массив любой длины, состоящий из чисел. Вывести в консоль самый первый и последний элементы. Код должен работать для массива любой длины.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15];

// console.log(array[0]);
// console.log(array[array.length - 1]);
// =======================================================================

// 4. Задача
// Создать массив любой длины, состоящий из чисел. Вывести значение предпоследнего элемента. Код должен работать для массива любой длины.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 15];

// console.log(array[array.length - 2]);
// =======================================================================

// 5. Задача
// Создать массив любой длины, состоящий из строк. Удалить последний элемент. А затем добавить 1 элемент в конец массива со значением new. Вывести в консоль получившийся массив.

// const myArray = ['cake', 'ice-cream', 'milk', 'cocktail'];
// // const myArray2 = [];

// myArray.pop();
// console.log(myArray);
// myArray.push('new');

// // for (let i = 0; i < myArray.length; i++) {
// //   myArray2.push(myArray[i])
// // }

// console.log(myArray);
// // console.log(myArray2 === myArray);

// =======================================================================

// 6. Задача
// Создать массив любой длины, состоящий из строк. Удалить последний элемент и вывести получившийся массив. Затем вывести значение удалённого элемента.

// const myArray = ['cake', 'ice-cream', 'milk', 'cocktail'];
// myArray.pop();
// console.log(myArray);
// console.log(myArray.pop());

// ========================================================================


// 7. Задача
// Создать массив с любым количеством элементов и любым типом данных внутри. Если элементов больше 5, то вывести в консоль "окей" Иначе ничего не выводить.

// const myArray = ['cake', 20, 'ice-cream', 12, 'milk', true, 'cocktail', null, 67];
// if (myArray.length > 5);
// console.log('окей');


//const myArray = ['cake', 20, 'ice-cream', 12, 'milk', true, 'cocktail', null, 67];

// if (myArray.length > 5);
// console.log('окей');

// =======================================================================

// 8. Задача
// Создать массив любой длины, состоящий из чисел. Если последний элемент чётный, то удалить его из массива, а затем вывести в консоль. В противном случае просто вывести первый элемент массива.


// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
// if (array[array.length - 1] % 2 === 0) {
//   // array.pop();
//   console.log(array.pop());
// } else {
//   console.log(array[0]);
// }


// ========================================================================

// 9. Задача
// Дан массив чисел. Вывести массив поэлементно в консоль.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];

// for (const el of array) {
//   console.log(el);
// }

// ========================================================================


// 10. Задача
// Создать массив любой длины, состоящий из чисел.

// Если значение первого элемента больше значения последнего элемента,
// то добавить в конец массива текст more, Иначе удалить последний элемент.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
// if (array[0] > array[array.length - 1]) {
//   array.push('more');
// } else {
//   array.pop()
// }
// console.log(array);

// ========================================================================


// 11. Задача
// Создать массив любой длины, состоящий из чисел.
// Добавлять к каждому третьему элементу массива строку: =x3=.
// Вывести в кнсоль получившийся массив

//             0  1  2  3  4  5  6  7  8   9  10  11
// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];

// for (let i = 0; i < array.length; i++) {
//   if (((i + 1) % 3) === 0) {
//     array[i] += ' =3='
//   }
// }
// console.log(array);

// ========================================================================

// 12. Задача
// Дан массив чисел. Вывести в консоль элементы массива в столбик в обратном порядке.

// const array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
// for (let i = array.length - 1; i >= 0; i--) {
//   console.log(array[i]);
// }

// ========================================================================

// 13. Задача
// Создать пустой массив. Заполнить его тремя элементами, которые введёт пользователь с клавиатуры. Вывести в консоль получившийся массив.

// const myArray = [];
// myArray.push(prompt('Write your name'));
// myArray.push(prompt('Write your age'));
// myArray.push(prompt('Write your adress'));
// console.log(myArray)


// let userName = prompt('Write your name');
// let userAge = prompt('Write your age');
// let userAdress = prompt('Write your adress');
// const array = [userName, userAge, userAdress];
// console.log(array);


// ========================================================================

// 14. Задача
// Запросить у пользователя число - кол-во элементов будущего массива. И в зависимости от введённого числа пользователь заполняет с клавиатуры все элементы сам. Вывести в консоль получившийся массив.


// let userNum = Number(prompt('Enter the number of elements of the future array'));
// const array = [];

// for (let i = 0; i < userNum; i++) {
//   let enterUserNum = prompt(`write elements ${i + 1}/${userNum}`)
//   array.push(enterUserNum)
// }
// console.log(array);

// ========================================================================

// 15. Задача
// Дан массив чисел. Вывести в консоль только положительные значения.

// const array = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12];
// const array2 = [];
// for (const el of array) {
//   if (el > 0) {
//     array2.push(el)
//   }
// }
// console.log(array2);


// ========================================================================


// 16. Задача

// ! Победить страх  на создание переменных
// * Талончики выданы 1000000x шт

// Вывести в консоль самое большое значение из массива.

// const array = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];

// let maxElement = 0;
// for (const el of array) {
//   if (el > maxElement) {
//     maxElement = el
//   }
// }
// console.log(maxElement);


// ==========================================================================


// 17. Задача
// Вывести в консоль сумму всех чисел массива.

// const array = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// let sum = 0;
// for (const el of array) {
//   sum += el
// }
// console.log(sum);
// ==========================================================================


// 18. Задача
// Вывести в консоль индекс самого минимального значения из массива numberArray.

// const array = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// let minElement = 0;

// for (const el of array) {
//   if (el < minElement) {
//     minElement = el
//   }
// }
// console.log(minElement);

// ==========================================================================


// 19. Задача
// Вывести в консоль сумму всех чётных чисел массива numberArray.

// const array = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// let sumEvenEl = 0;
// for (const el of array) {
//   if (el % 2 === 0) {
//     sumEvenEl += el
//   }
// }

// console.log(sumEvenEl);
// ==========================================================================



// 20. Задача
// Вывести в консоль сумму всех чисел кратных 3 массива numberArray.

// const numberArray = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// let sumEveryThirdEl = 0;
// for (const el of numberArray) {
//   if (el % 3 === 0) {
//     sumEveryThirdEl += el
//   }
// }

// console.log(sumEveryThirdEl);

// ==========================================================================


// 21. Задача
// Перенести значения, кратные 3 из массива numberArray в массив newArr;

// const numberArray = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// const newArr = [];

// // for (const el of numberArray) {
// //   if (el % 3 === 0) {
// //     newArr.push(el)
// //   }
// // }
// console.log(newArr);

// for (const el of numberArray) {
//   if (el === el) {
//     newArr.push(el)
//   }
// }
// console.log(numberArray === newArr);

// ==========================================================================

// 22. Задача
// Написать программу, которая посчитает количество строк и чисел в массиве varArray. Результат вывести в консоль с подписью, где число строк, а где чисел.

// const numberArray = [1, -2, 3, 4, 'js', 6, 7, -8, 'html', 10, 11, 'css', 24];
// let countStr = 0;
// let countNum = 0;

// for (const el of numberArray) {
//   if (typeof el === 'string') {
//     countStr++;
//   } else if (typeof el === 'number') {
//     countNum++;
//   }
// }
// console.log(`Количество строк в массиве: ${countStr}`);
// console.log(`Количество чисел в массиве: ${countNum}`);
// ==========================================================================

// 23. Задача
// Написать программу, которая посчитает количество массивов внутри массива testArray.

// const testArray = [1, -2, 3, 4, 'js', [6, 7, -8], 'html', 10, 11, [], 'css', 24];
// let countArray = 0;
// for (const el of testArray) {
//   if (typeof el === 'object') {
//     countArray++;
//   }
// }
// console.log(countArray);
// ==========================================================================

// 24. Задача

// Дан массив чисел. Вывести в консоль среднее арифметическое отрицательных элементов массива numberArray.

// const numberArray = [1, -2, 3, 4, -5, 6, 7, -8, 9, 10, 11, -12, 24];
// let sumNegativeNum = 0;
// let countNegativeNum = 0;
// let arithmeticMeanNum = 0;

// for (const el of numberArray) {
//   if (el < 0) {
//     sumNegativeNum += el;
//     countNegativeNum++;
//     arithmeticMeanNum = (sumNegativeNum / countNegativeNum)
//     // debugger
//   }
// }
// console.log(arithmeticMeanNum);

// ==========================================================================

// 25. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr = [3, 7, 4];
// const newArr = arr;

// newArr.push(7);
// console.log(arr); // ? arr [3, 7, 4, 7]


// ==========================================================================

// 26. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr = [2, 1, 5];

// const newArr = arr;
// arr.pop();

// console.log(newArr); // ? newArr [2, 1]
// ==========================================================================

// 27. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr = [2, 1, 5];
// const newArr = arr;
// const antArr = newArr;

// antArr.unshitf(5, 4);
// antArr.unshift(5, 4);

// console.log(arr); // ? arr [5, 4, 2, 1, 5]
// console.log(newArr); // ? newArr [5, 4, 2, 1, 5]
// console.log(antArr); // ? antArr [5, 4, 2, 1, 5]
// ==========================================================================

// 28. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr = [6, 9, 3];
// const list = arr;

// list[2] = 7;
// arr[4] = 12;

// console.log(arr); // ? arr [6, 9, 7, 12]
// console.log(list); // ? list [6, 9, 7, 12]
// console.log(list.length); // ? 5
// ==========================================================================

// 29. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr = [1, 2];
// const copyArr = arr;
// const othArr = arr;

// copyArr.push(1, 2);
// othArr.shift();

// console.log(arr); // ? arr [2, 1, 2]
// console.log(copyArr); // ? copyArr [2, 1, 2]
// console.log(othArr); // ? othArr [2, 1, 2]
// ==========================================================================

// 30. Задача
// Дан массив. Написать программу, которая скопирует массив targetList в другую переменную. При изменении скопированного массива (при добавлении, удалении) исходный массив не должен изменяться.

// const targetList = [4, 5, true, 3, 'text', 1, null];
// const newArr = [];





// // newArr.push(12)
// console.log(newArr);
// console.log(targetList);

// console.log([] === []); // false
// console.log(newArr === targetList); // Сранить ссылки (ключи от дома)

// ==========================================================================

// 31. Задача
// Даны 2 массива, перенести каждый третий элемент из массива basicList в массив everyThreeList. Программа должна работа для массива любой длины.


// i                0   1  2     3  4  5   6  7   8
// const basicList = [-11, 3, 23, -14, 5, 43, 3, 14, -1, 65, 5, -9, 10, 11, 17, 2, 1];
// const everyThreeList = [];




// ==========================================================================

// 32. Задача
// Дан массив чисел, вывести в консоль произведение всех нечётных положительных чисел.

// const numberArray = [-199, 6, 22, -31, 7, -6, 1, 11, -3, 0, 5, -99];
// let compositionOddPositionNumbers = 1;



// ==========================================================================

// 33. Задача
// Дан массив чисел, вывести в консоль количество отрицательных чисел.

// const numberList = [-199, 30, 10, 15, -1, -12, 43, 38, -7, 3, 5, -4, -99];



// ==========================================================================

// 34. Задача
// Дан массив чисел, вывести в консоль общее количество массивов и null.

// const list = [[-199, 30, 10, 15], -1, null, '43', null, [-7, 3, 5], 'null', -99, [], 4, null];


// ==========================================================================

// 35. Задача
// Не выполняя код, дать ответ:
// Что выведется в консоль? Ответ записать в комментарий.

// const arr1 = [3, 4, 5];
// const arr2 = [3, 4, 5];
// console.log(arr1 === arr2); // ? false  Так как константы имеют разные ссылки на массив, несмотря на то, что элементы в массивах совершенно одинааовые.

// const copyArr1 = arr1; // Скопировали ключ (ссылка)
// console.log(copyArr1 === arr1); // ? true - ключи(ссылки) одинаковые
// ==========================================================================

// ★ Задачи повышенной сложности ★

// ★ 36. Задача ★ VVV
// Дан массив товаров и цен в корзине, посчитать сумму всей покупки и вывести результат в консоль.

// const cartList = [
//   ['carot', 200],
//   ['potato', 300],
//   ['milk', 80],
//   ['mushrooms', 600],
//   ['beet', 200],
//   ['сabbage', 300]
// ];


// ==========================================================================


// ★ 37. Задача ★
// Создать пустой массив. Пользователя запрашивают вводить числа до тех пор, пока он не введёт слово 'Хватит'. Как только пользователь ввёл слово, вывести массив чисел.

// Массив должен состоять из типа number, не string;
// Слово Хватит не зависит от регистра, можно написать, как с маленькой, так и сбольшой буквы;

// let userArr = [];

// while (true) {
//   let userNumber = Number(prompt('Write your number'));
//   if (userNumber === 10) {
//     break;
//   }
//   // userArr.push(userNumber);
//   console.log(userNumber);
// }
// // console.log(userArr);

// let counter = 10;
// while (true) {
//   let num = Number(prompt('Write your number'));
//   console.log(num);
//   if (num === 9999) {
//     break;
//   }
// }

// ==========================================================================


// ★ 38. Задача ★ VVV
// Выполнить сортировку массива array. Четные элементы отправьте в массив arrayEven, а нечетные - в arrayOdd. А если встречается значение 0, то проигнорировать его (Переносить в arrayEven не нужно).

// array = [9, 2, 7, -2, 4, 34, -7, -12, 28, 14, 0, 15, 22,];
// arrayEven = [];
// arrayOdd = [];

// for (let i = 0; i < array.length; i++) {
//   if (array[i] % 2 === 0 && array[i] !== 0) {
//     arrayEven.push(array[i])
//   } else if (array[i] % 2 !== 0 && array[i] !== 0) {
//     arrayOdd.push(array[i])
//   }
// }

// for (const el of array) {
//   if (el !== 0) {
//     if (el % 2 === 0) {
//       arrayEven.push(el)
//     } else {
//       arrayOdd.push(el)
//     }
//   }
// }


// for (const el of array) {
//   if (el !== 0) {
//     el % 2 === 0 ? arrayEven.push(el) : arrayOdd.push(el)
//   }
// }

// for (const el of array) {
//   el !== 0 && (el % 2 === 0 ? arrayEven.push(el) : arrayOdd.push(el))
// }


// ! Похвастаться
// for (const el of array) el !== 0 && (el % 2 === 0 ? arrayEven.push(el) : arrayOdd.push(el))

// console.log(arrayEven);
// console.log(arrayOdd);


// array = [9, 2, 7, -2, 4, 34, -7, -12, 28, 14, 0, 15, 22,];
// arrayEven = [];
// arrayOdd = [];

// for (let i = 0; i < array.length; i++) {
//   (array[i] % 2 === 0 && array[i] !== 0) ? arrayEven.push(array[i]) : arrayOdd.push(array[i])
// }
// console.log(arrayEven);
// console.log(arrayOdd);

// ==========================================================================


// ★ 39. Задача ★
// ! Гуглить: методы сортировки массива

// Дан массив чисел, написать программу, которая отсортирует исходный массив в порядке возрастания. Без использования метода sort();

// array = [25, 32, 17, 99, 15];

// let sortArr = 0;
// for (let i = 0; array.length; i++) {
//   // if (array[0] > array[1]) {
//   //   console.log(500);
// }

// ==========================================================================


// ★ 40. Задача ★
// Дан массив. Вывести в консоль все элементы массива в матричном виде:

// const array = [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45]
// ];

// output:
// 11 12 13 14 15
// 21 22 23 24 25
// 31 32 33 34 35
// 41 42 43 44 45

// ==========================================================================


// ★ 41. Задача ★
// Дан массив. Заменить в массиве значения: 11, 22, 33, 44, 55 на строку 00.

// const array = [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55]
// ];


// ==========================================================================










// Дополнительные задачи:



// Дан массив, выполнить следующие задачи:
// 1. Если количество элементов больше 3, то вывести '!!!' в консоль, иначе удалить последний элемент

// const arr = ['lunatic', 'poring', 'spore'];
// if (arr.length > 3) {
//   console.log('!!!');
// } else {
//   arr.pop()
// }
// console.log(arr);


// 2. ГРОМОЗДКАЯ задачка
// Дан массив, состоящий из чисел
// Если первый элемент делится на 3, то добавить в конец массива число 7
// А Если последний элемент делится на 3, то добавить в начало масива число 9
// Иначе удалить первый и последний элементы массива

// const numberList = [6, 2, 1, 1, 1, 0, 3]
// if (numberList[0] % 3 === 0) {
//   numberList.push(7);
// } else if (numberList[numberList.length - 1] % 3 === 0) {
//   numberList.unshift(9);
// } else {
//   numberList.shift();
//   numberList.pop();
// }
// console.log(numberList);

// 3. Дан массив чисел. Вывести все числа в столбик

// const arrayList = [3, 2, 1, 1, 1, 0, 5];
// for (let i = 0; i < arrayList.length; i++) {
//   // console.log(arrayList); // Вывести массив
//   // console.log(arrayList[i]); // Вывести элемент
//   // console.log(i); // Вывести индекс

//   console.log(`index: ${i}; value: ${arrayList[i]}; array: [${arrayList}]`);
// }

// 4. Задача
// Дан массив чисел. Вывести каждое второе число из массива
// * (но выводить его если значение делится на 3)

// const randomArray = [5, 3, 6, 8, 5, 6, 3, 18, 1, 12, 2]
// for (let i = 0; i < randomArray.length; i += 2) {
//   if (randomArray[i] % 3 === 0) {
//     console.log(randomArray[i]);
//   }
//   // console.log(randomArray[i]);
// }

// const randomArray = [5, 3, 6, 8, 5, 6, 3, 18, 1, 12, 2]
// for (let i = 0; i < randomArray.length; i++) {
//   if (i % 2 === 0 && randomArray[i] % 3 === 0) {
//     console.log(randomArray[i]);
//   }
//   // console.log(randomArray[i]);
// }

// const randomArray = [5, 3, 6, 8, 5, 6, 3, 18, 1, 12, 2]
// for (let i = 0; i < randomArray.length; i++) {
//   if (i % 2 === 0) {
//     if (randomArray[i] % 3 === 0) {
//       // console.log(randomArray[i]);
//     }
//     console.log(randomArray[i]);
//   }
// }






// let countNum = 0
// for (let i = 0; i < arr.length; i++) {
//   if (typeof arr[i] === 'number') {
//     countNum++;;
//   }
// }
// console.log(countNum);



// console.log(sumArr);