// 1. Задача
// Перевести название темы на русский язык и закомментировать.

// variable - переменная
// ==================================================================

// 2. Задача
// Создайте многострочный комментарий и поместите следующий текст:

/* Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
При этом может иметь значения, как NaN (Not a Number),
Так и бесконечность (Infinity / -Infinity) */
// ===================================================================

// 3. Задача
// Выполнить задачу 2, пользуясь однострочным комментарием.

// Тип number может принимать значения от -2e53-1 до 2e53-1 вкл
// При этом может иметь значения, как NaN (Not a Number),
// Так и бесконечность (Infinity / -Infinity) 
// ===================================================================

// 4. Задача
// Создайте переменную test, чему равно значение этой переменной ? Ответ записать в комментарий.
let test = 'test';
// Переменная test равна типу string.
// ===================================================================

// 5. Задача
// Создайте переменную num и присвойте ей любое число.
let num = 10;
// ===================================================================

// 6. Задача
// Создайте переменную text и присвойте ей любой текст.
let text = 'anover text'
// ===================================================================

// 7. Задача
// Создайте переменную типа boolean.
let isAdmin = true;
// ===================================================================

// 8. Задача
// Создайте переменную с именем variable присвойте ей пустое значение.
let variable = null;
// ===================================================================

// 9. Задача
// Создайте константную переменную, которая хранит число e(экспонента).
const EXPONENTIAL = 1e3;
// ===================================================================

// 10. Задача
// Создайте константную переменную, которая хранит чёрный цвет для css.
const COLOR_CSS = '#000;'
// ===================================================================

// 11. Задача
// Сделать рефакторинг кода:

// Variable declarations
// var StUdLyCapVaR;
// var properCamelCase;
// var TitleCaseOver;

// Variable assignments
// STUDLYCAPVAR = 10;
// PRoperCAmelCAse = "A String";
// titleCaseOver = 9000;

// рефакторинг
// Variable declarations
// var studlyCapVaR;
// var properCamelCase;
// var titleCaseOver;

// Variable assignments
// studyCapVar = 10;
// properCamelCAse = "A String";
// titltCaseOver = 9000;

// ===================================================================

// ★ Задачи повышенной сложности ★
// ★ 12. Задача ★
// Не выполняя код скажите, что будет если выполнится этот код и почему:

var numTest = 10;
var numTest = 15;

let numberTest = 10;
// let numberTest = 15;